experiment-finetuned/all_finetuned/runs/counterFlowFlame2D/1/constant/combustionProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

combustionModel  laminar;

active          true;

laminarCoeffs
{
}

// ************************************************************************* //