experiment-finetuned/all_finetuned/runs/counterFlowFlame2D/1/constant/physicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         multiComponentMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

inertSpecie N2;

species
(
    CH4
    O2
    N2
    H2O
    CO2
);

// Species thermodynamic data
CH4
{
    specie
    {
        name CH4;
    }
    thermo
    {
        Tlow        200;
        Thigh       6000;
        Tcommon     1000;
        highCpCoeffs
        (
            5.19532
            -0.0026667
            4.492e-06
            -2.899e-09
            6.645e-13
            -1169.6
            11.466
        );
        lowCpCoeffs
        (
            5.19532
            -0.0026667
            4.492e-06
            -2.899e-09
            6.645e-13
            -1169.6
            11.466
        );
    }
    transport
    {
        As          5.743e-07;
        Ts          131.0;
    }
}

O2
{
    specie
    {
        name O2;
    }
    thermo
    {
        Tlow        200;
        Thigh       6000;
        Tcommon     1000;
        highCpCoeffs
        (
            3.636
            0.506
            -0.000197
            2.72e-08
            -1.00e-11
            -3667.9
            5.696
        );
        lowCpCoeffs
        (
            3.636
            0.506
            -0.000197
            2.72e-08
            -1.00e-11
            -3667.9
            5.696
        );
    }
    transport
    {
        As          3.64e-07;
        Ts          107.4;
    }
}

N2
{
    specie
    {
        name N2;
    }
    thermo
    {
        Tlow        200;
        Thigh       6000;
        Tcommon     1000;
        highCpCoeffs
        (
            2.926
            0.0808
            -0.000041
            0.000000
            0.000000
            -8669.4
            3.298
        );
        lowCpCoeffs
        (
            2.926
            0.0808
            -0.000041
            0.000000
            0.000000
            -8669.4
            3.298
        );
    }
    transport
    {
        As          3.64e-07;
        Ts          91.2;
    }
}

H2O
{
    specie
    {
        name H2O;
    }
    thermo
    {
        Tlow        200;
        Thigh       6000;
        Tcommon     1000;
        highCpCoeffs
        (
            3.03399
            0.001575
            -0.000001
            0.000000
            0.000000
            -241826
            4.906
        );
        lowCpCoeffs
        (
            3.03399
            0.001575
            -0.000001
            0.000000
            0.000000
            -241826
            4.906
        );
    }
    transport
    {
        As          2.65e-07;
        Ts          81.6;
    }
}

CO2
{
    specie
    {
        name CO2;
    }
    thermo
    {
        Tlow        200;
        Thigh       6000;
        Tcommon     1000;
        highCpCoeffs
        (
            2.356
            0.000000
            0.000000
            0.000000
            0.000000
            -393522
            9.901
        );
        lowCpCoeffs
        (
            2.356
            0.000000
            0.000000
            0.000000
            0.000000
            -393522
            9.901
        );
    }
    transport
    {
        As          4.43e-07;
        Ts          195.1;
    }
}

chemistryReader foamChemistryReader;
foamChemistryFile "<constant>/reactions";
foamChemistryThermoFile "<constant>/thermo.compressibleGas";

// ************************************************************************* //