experiment-finetuned/all_finetuned/runs/counterFlowFlame2D/1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    fuel
    {
        type            patch;
        nFaces          40;
        startFace       3120;
    }
    air
    {
        type            patch;
        nFaces          40;
        startFace       3160;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       3200;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3200;
        startFace       3280;
    }
)

// ************************************************************************* //
