experiment-finetuned/all_finetuned/runs/counterFlowFlame2D/1/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

timePrecision   8;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1;

maxDeltaT       1;

// ************************************************************************* //